"""
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
"""

# Через dict
while True:
    month = input('Введите номер месяца\n>>>')
    if month.isdigit() == False or int(month)>12 or int(month)<1:
        print(f'Введён некорректный месяц')
        break

    my_dict = {
        1: "Зима",
        2: "Зима",
        3: "Весна",
        4: "Весна",
        5: "Весна",
        6: "Лето",
        7: "Лето",
        8: "Лето",
        9: "Осень",
        10: "Осень",
        11: "Осень",
        12: "Зима",
    }

    print(my_dict.get(int(month)))

    # Через list

    my_list = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
    print(my_list[int(month)-1])
    break
